# 1. 1.	Екі санның минимумын табу
a = int(input("бірінші санды жазыңыз(мин табу): "))
b = int(input("екінші санды жазыңыз: "))
if a < b:
    print("Минимум:", a)
else:
    print("Минимум:", b)


# 2. 2.	Жұп немесе тақ
n = int(input("Сан жазыңыз(жуп или так): "))
if n % 2 == 0:
    print("Сан жұп")
else:
    print("сан тақ")


# 3.	1-ден N-ге дейінгі сандардың қосындысы
N = int(input("N(1-ден N-ге дейінгі сандардың қосындысы ) : "))
s = 0
for i in range(1, N + 1):
    s += i
print("Сумма:", s)


# 4. 4.	Көбейту кестесі
N = int(input(" сан жаз (көбейту кестесі): "))
for i in range(1, 11):
    print(f"{N} x {i} = {N * i}")


# 5. 5.	Факториалды табу
N = int(input("сан жазыңыз (факториал): "))
fact = 1
for i in range(1, N + 1):
    fact *= i
print("Факториал:", fact)


# 6. 6.	Дауысты әріптердің саны
text = input("жол жазыныз: ")
dauystyArip = "aeiouAEIOUауоыиэяюёеАУОЫИЭЯЮЁЕ"
count = 0
for ch in text:
    if ch in dauystyArip:
        count += 1
print("дауысты ариптер:", count)


# 7. 7.	Жолды кері шығару
text = input("жол жазыныз(наоборот шыгарад): ")
print("керсінше: ", text[::-1])


# 8. 8.	Массивтегі максимумды табу
arr = list(map(int, input("пробелмен кез келген сандар жазыңыз(массив макс): ").split()))
print("Максимум:", max(arr))


# 9. 9.	Массив элементтерінің қосындысы
arr = list(map(int, input("пробелмен кез келген сандар жазыңыз(массив косынды): ").split()))
print("Косындысы:", sum(arr))


# 10. 10.	Массивтен элемент іздеу
arr = list(map(int, input("пробелмен кез келген сандар жазыңыз ( массив тан сан табу): ").split()))
x = int(input("Іздейтін сан: "))
if x in arr:
    print(f"{x} массивта бар")
else:
    print(f"{x} массивта жоқ")
